{"weightsManifest": [{"paths": ["group1-shard1of54.bin", "group1-shard2of54.bin", "group1-shard3of54.bin", "group1-shard4of54.bin", "group1-shard5of54.bin", "group1-shard6of54.bin", "group1-shard7of54.bin", "group1-shard8of54.bin", "group1-shard9of54.bin", "group1-shard10of54.bin", "group1-shard11of54.bin", "group1-shard12of54.bin", "group1-shard13of54.bin", "group1-shard14of54.bin", "group1-shard15of54.bin", "group1-shard16of54.bin", "group1-shard17of54.bin", "group1-shard18of54.bin", "group1-shard19of54.bin", "group1-shard20of54.bin", "group1-shard21of54.bin", "group1-shard22of54.bin", "group1-shard23of54.bin", "group1-shard24of54.bin", "group1-shard25of54.bin", "group1-shard26of54.bin", "group1-shard27of54.bin", "group1-shard28of54.bin", "group1-shard29of54.bin", "group1-shard30of54.bin", "group1-shard31of54.bin", "group1-shard32of54.bin", "group1-shard33of54.bin", "group1-shard34of54.bin", "group1-shard35of54.bin", "group1-shard36of54.bin", "group1-shard37of54.bin", "group1-shard38of54.bin", "group1-shard39of54.bin", "group1-shard40of54.bin", "group1-shard41of54.bin", "group1-shard42of54.bin", "group1-shard43of54.bin", "group1-shard44of54.bin", "group1-shard45of54.bin", "group1-shard46of54.bin", "group1-shard47of54.bin", "group1-shard48of54.bin", "group1-shard49of54.bin", "group1-shard50of54.bin", "group1-shard51of54.bin", "group1-shard52of54.bin", "group1-shard53of54.bin", "group1-shard54of54.bin"], "weights": [{"dtype": "float32", "shape": [1, 1, 448, 2080], "name": "module/InceptionResnetV2/Block8/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [2080], "name": "module/InceptionResnetV2/Block8/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_10/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_10/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 320], "name": "module/InceptionResnetV2/Repeat/block35_10/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [320], "name": "module/InceptionResnetV2/Repeat/block35_10/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [], "name": "module_apply_default/hub_input/Mul/y"}, {"dtype": "float32", "shape": [], "name": "module_apply_default/hub_input/Sub/y"}, {"dtype": "float32", "shape": [1, 1, 128, 320], "name": "module/InceptionResnetV2/Repeat/block35_1/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [320], "name": "module/InceptionResnetV2/Repeat/block35_1/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_1/mul/y"}, {"dtype": "float32", "shape": [1, 1, 128, 320], "name": "module/InceptionResnetV2/Repeat/block35_2/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [320], "name": "module/InceptionResnetV2/Repeat/block35_2/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 320], "name": "module/InceptionResnetV2/Repeat/block35_3/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [320], "name": "module/InceptionResnetV2/Repeat/block35_3/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 320], "name": "module/InceptionResnetV2/Repeat/block35_4/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [320], "name": "module/InceptionResnetV2/Repeat/block35_4/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 320], "name": "module/InceptionResnetV2/Repeat/block35_5/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [320], "name": "module/InceptionResnetV2/Repeat/block35_5/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 320], "name": "module/InceptionResnetV2/Repeat/block35_6/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [320], "name": "module/InceptionResnetV2/Repeat/block35_6/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 320], "name": "module/InceptionResnetV2/Repeat/block35_7/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [320], "name": "module/InceptionResnetV2/Repeat/block35_7/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 320], "name": "module/InceptionResnetV2/Repeat/block35_8/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [320], "name": "module/InceptionResnetV2/Repeat/block35_8/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 128, 320], "name": "module/InceptionResnetV2/Repeat/block35_9/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [320], "name": "module/InceptionResnetV2/Repeat/block35_9/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_1/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_1/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_1/mul/y"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_2/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_2/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_3/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_3/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_4/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_4/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_5/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_5/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_6/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_6/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_7/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_7/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_8/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_8/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_9/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_9/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_11/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_11/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_12/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_12/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_13/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_13/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_14/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_14/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_15/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_15/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_16/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_16/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_17/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_17/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_18/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_18/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_19/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_19/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 384, 1088], "name": "module/InceptionResnetV2/Repeat_1/block17_20/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [1088], "name": "module/InceptionResnetV2/Repeat_1/block17_20/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 448, 2080], "name": "module/InceptionResnetV2/Repeat_2/block8_1/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [2080], "name": "module/InceptionResnetV2/Repeat_2/block8_1/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_2/block8_1/mul/y"}, {"dtype": "float32", "shape": [1, 1, 448, 2080], "name": "module/InceptionResnetV2/Repeat_2/block8_2/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [2080], "name": "module/InceptionResnetV2/Repeat_2/block8_2/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 448, 2080], "name": "module/InceptionResnetV2/Repeat_2/block8_3/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [2080], "name": "module/InceptionResnetV2/Repeat_2/block8_3/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 448, 2080], "name": "module/InceptionResnetV2/Repeat_2/block8_4/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [2080], "name": "module/InceptionResnetV2/Repeat_2/block8_4/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 448, 2080], "name": "module/InceptionResnetV2/Repeat_2/block8_5/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [2080], "name": "module/InceptionResnetV2/Repeat_2/block8_5/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 448, 2080], "name": "module/InceptionResnetV2/Repeat_2/block8_6/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [2080], "name": "module/InceptionResnetV2/Repeat_2/block8_6/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 448, 2080], "name": "module/InceptionResnetV2/Repeat_2/block8_7/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [2080], "name": "module/InceptionResnetV2/Repeat_2/block8_7/Conv2d_1x1/biases"}, {"dtype": "float32", "shape": [1, 1, 448, 2080], "name": "module/InceptionResnetV2/Repeat_2/block8_8/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [2080], "name": "module/InceptionResnetV2/Repeat_2/block8_8/Conv2d_1x1/biases"}, {"dtype": "int32", "shape": [], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_5b/concat/axis"}, {"dtype": "float32", "shape": [1, 1, 448, 2080], "name": "module/InceptionResnetV2/Repeat_2/block8_9/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [2080], "name": "module/InceptionResnetV2/Repeat_2/block8_9/Conv2d_1x1/biases"}, {"dtype": "int32", "shape": [2], "name": "module_apply_default/InceptionResnetV2/Logits/global_pool/reduction_indices"}, {"dtype": "int32", "shape": [1], "name": "module_apply_default/InceptionResnetV2/Logits/Flatten/flatten/strided_slice/stack"}, {"dtype": "int32", "shape": [1], "name": "module_apply_default/InceptionResnetV2/Logits/Flatten/flatten/strided_slice/stack_1"}, {"dtype": "int32", "shape": [], "name": "module_apply_default/InceptionResnetV2/Logits/Flatten/flatten/Reshape/shape/1"}, {"dtype": "float32", "shape": [1536, 1001], "name": "module/InceptionResnetV2/Logits/Logits/weights"}, {"dtype": "float32", "shape": [1001], "name": "module/InceptionResnetV2/Logits/Logits/biases"}, {"dtype": "float32", "shape": [3, 3, 3, 32], "name": "module/InceptionResnetV2/Conv2d_1a_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Conv2d_1a_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Conv2d_2a_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Conv2d_2a_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 64], "name": "module/InceptionResnetV2/Conv2d_2b_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Conv2d_2b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 64, 80], "name": "module/InceptionResnetV2/Conv2d_3b_1x1/weights"}, {"dtype": "float32", "shape": [80], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Conv2d_3b_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 80, 192], "name": "module/InceptionResnetV2/Conv2d_4a_3x3/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Conv2d_4a_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 192, 96], "name": "module/InceptionResnetV2/Mixed_5b/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [96], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_5b/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 192, 48], "name": "module/InceptionResnetV2/Mixed_5b/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_5b/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 192, 64], "name": "module/InceptionResnetV2/Mixed_5b/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_5b/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 192, 64], "name": "module/InceptionResnetV2/Mixed_5b/Branch_3/Conv2d_0b_1x1/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_5b/Branch_3/Conv2d_0b_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [5, 5, 48, 64], "name": "module/InceptionResnetV2/Mixed_5b/Branch_1/Conv2d_0b_5x5/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_5b/Branch_1/Conv2d_0b_5x5/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 64, 96], "name": "module/InceptionResnetV2/Mixed_5b/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [96], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_5b/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 96, 96], "name": "module/InceptionResnetV2/Mixed_5b/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [96], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_5b/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_1/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_1/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_1/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_1/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_1/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 48], "name": "module/InceptionResnetV2/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_1/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 48, 64], "name": "module/InceptionResnetV2/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_1/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_2/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_2/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_2/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_2/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_2/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 48], "name": "module/InceptionResnetV2/Repeat/block35_2/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_2/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 48, 64], "name": "module/InceptionResnetV2/Repeat/block35_2/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_2/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_3/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_3/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_3/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_3/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_3/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_3/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Repeat/block35_3/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_3/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 48], "name": "module/InceptionResnetV2/Repeat/block35_3/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_3/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 48, 64], "name": "module/InceptionResnetV2/Repeat/block35_3/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_3/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_4/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_4/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_4/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_4/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_4/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_4/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Repeat/block35_4/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_4/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 48], "name": "module/InceptionResnetV2/Repeat/block35_4/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_4/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 48, 64], "name": "module/InceptionResnetV2/Repeat/block35_4/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_4/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_5/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_5/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_5/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_5/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_5/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_5/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Repeat/block35_5/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_5/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 48], "name": "module/InceptionResnetV2/Repeat/block35_5/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_5/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 48, 64], "name": "module/InceptionResnetV2/Repeat/block35_5/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_5/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_6/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_6/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_6/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_6/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_6/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_6/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Repeat/block35_6/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_6/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 48], "name": "module/InceptionResnetV2/Repeat/block35_6/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_6/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 48, 64], "name": "module/InceptionResnetV2/Repeat/block35_6/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_6/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_7/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_7/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_7/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_7/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_7/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_7/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Repeat/block35_7/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_7/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 48], "name": "module/InceptionResnetV2/Repeat/block35_7/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_7/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 48, 64], "name": "module/InceptionResnetV2/Repeat/block35_7/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_7/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_8/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_8/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_8/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_8/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_8/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_8/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Repeat/block35_8/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_8/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 48], "name": "module/InceptionResnetV2/Repeat/block35_8/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_8/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 48, 64], "name": "module/InceptionResnetV2/Repeat/block35_8/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_8/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_9/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_9/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_9/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_9/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_9/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_9/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Repeat/block35_9/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_9/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 48], "name": "module/InceptionResnetV2/Repeat/block35_9/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_9/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 48, 64], "name": "module/InceptionResnetV2/Repeat/block35_9/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_9/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_10/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_10/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_10/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_10/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 32], "name": "module/InceptionResnetV2/Repeat/block35_10/Branch_2/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_10/Branch_2/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 32], "name": "module/InceptionResnetV2/Repeat/block35_10/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [32], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_10/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 32, 48], "name": "module/InceptionResnetV2/Repeat/block35_10/Branch_2/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [48], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_10/Branch_2/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 48, 64], "name": "module/InceptionResnetV2/Repeat/block35_10/Branch_2/Conv2d_0c_3x3/weights"}, {"dtype": "float32", "shape": [64], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat/block35_10/Branch_2/Conv2d_0c_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 320, 384], "name": "module/InceptionResnetV2/Mixed_6a/Branch_0/Conv2d_1a_3x3/weights"}, {"dtype": "float32", "shape": [384], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_6a/Branch_0/Conv2d_1a_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 320, 256], "name": "module/InceptionResnetV2/Mixed_6a/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_6a/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 256, 256], "name": "module/InceptionResnetV2/Mixed_6a/Branch_1/Conv2d_0b_3x3/weights"}, {"dtype": "float32", "shape": [256], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_6a/Branch_1/Conv2d_0b_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [3, 3, 256, 384], "name": "module/InceptionResnetV2/Mixed_6a/Branch_1/Conv2d_1a_3x3/weights"}, {"dtype": "float32", "shape": [384], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Mixed_6a/Branch_1/Conv2d_1a_3x3/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_1/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_1/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_1/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_1/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_1/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_1/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_1/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_1/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_2/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_2/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_2/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_2/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_2/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_2/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_2/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_2/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_3/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_3/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_3/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_3/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_3/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_3/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_3/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_3/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_4/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_4/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_4/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_4/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_4/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_4/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_4/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_4/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_5/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_5/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_5/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_5/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_5/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_5/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_5/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_5/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_6/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_6/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_6/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_6/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_6/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_6/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_6/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_6/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_7/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_7/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_7/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_7/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_7/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_7/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_7/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_7/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_8/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_8/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_8/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_8/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_8/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_8/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_8/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_8/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_9/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_9/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_9/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_9/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_9/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_9/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_9/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_9/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_10/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_10/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_10/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_10/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_10/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_10/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_10/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_10/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_11/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_11/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_11/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_11/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_11/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_11/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_11/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_11/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_12/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_12/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_12/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_12/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_12/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_12/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_12/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_12/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_13/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_13/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": "module/InceptionResnetV2/Repeat_1/block17_13/Branch_1/Conv2d_0a_1x1/weights"}, {"dtype": "float32", "shape": [128], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_13/Branch_1/Conv2d_0a_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 7, 128, 160], "name": "module/InceptionResnetV2/Repeat_1/block17_13/Branch_1/Conv2d_0b_1x7/weights"}, {"dtype": "float32", "shape": [160], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_13/Branch_1/Conv2d_0b_1x7/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [7, 1, 160, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_13/Branch_1/Conv2d_0c_7x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_13/Branch_1/Conv2d_0c_7x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 192], "name": "module/InceptionResnetV2/Repeat_1/block17_14/Branch_0/Conv2d_1x1/weights"}, {"dtype": "float32", "shape": [192], "name": "module_apply_default/InceptionResnetV2/InceptionResnetV2/Repeat_1/block17_14/Branch_0/Conv2d_1x1/Conv2D_bn_offset"}, {"dtype": "float32", "shape": [1, 1, 1088, 128], "name": 